Revit 2016 API
ExternalServices.BuiltInExternalServices.PipePlumbingFixtureFlowService Property
 The external service which permits registration of an alternate implementation for pipe fixture flow calculation.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public static ExternalServiceId PipePlumbingFixtureFlowService { get; }
Visual Basic
Public Shared ReadOnly Property PipePlumbingFixtureFlowService As ExternalServiceId
	Get
Visual C++
public:
static property ExternalServiceId^ PipePlumbingFixtureFlowService {
	ExternalServiceId^ get ();
}
See Also
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace